<a href="https://colab.research.google.com/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S5_6_%28Groupby_and_Useful_Operations%29/DAwPy_S5_6_%28Groupby_and_Useful_Operations%29.ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory"></a><br/>
[![nbviewer](https://raw.githubusercontent.com/jupyter/design/master/logos/Badges/nbviewer_badge.svg)](https://nbviewer.org/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S5_6_%28Groupby_and_Useful_Operations%29/DAwPy_S5_6_%28Groupby_and_Useful_Operations%29.ipynb)

___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 05 & 06</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Groupby & Useful Operations</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [BASIC AGGREGATION METHODS](#1)
* [GROUPBY & AGGREGATION](#2)
    * [DataFrame.groupby()](#2.1)
* [DATAFRAME/SERIES OPERATIONS](#3)
    * [.aggregate()/agg()](#3.1)
        * [DataFrame.agg()](#3.1.1)
        * [DataFrame.groupby().agg()](#3.1.2)
    * [.filter()](#3.2)
        * [DataFrame.groupby().filter()](#3.2.1)
    * [.transform()](#3.3)
        * [DataFrame.groupby().transform()](#3.3.1)
    * [.apply()](#3.4)
        * [Series.apply() - df["col"].apply()](#3.4.1)
        * [DataFrame.apply()](#3.4.2)
    * [.applymap()](#3.5)
    * [.map()](#3.6)
        * [Series.map() - df["col"].map()](#3.6.1)
        * [DataFrame.map()](#3.6.2)
    * [df.transform() vs df.apply()](#3.7)
* [pivot() vs pivot_table()](#8)
* [.stack() & .unstack()](#9)
    * [.stack()](#9.1)
    * [.unstack()](#9.2)
* [THE END OF THE SESSION - 05 & 06](#10)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy you can import it as a library:

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
np.random.seed(42) #we created an array of set of a random numbers. 
# DataFrame,froupby splits the object applying a funciton and combining the results. 
# This can be used to group large amounts of data and compute operations on these groups.

In [2]:
list(map(lambda x: x + 1, [1, 2, 3, 4]))
list(map(lambda x: 2 * x, [1, 2, 3, 4]))

[2, 4, 6, 8]

In [3]:
def add_one(x):
    return x + 1

list(map(add_one, [1,2,3,4]))

[2, 3, 4, 5]

In [4]:
df = pd.DataFrame(np.random.randint(0, 100, size=(7, 5)), 
                  columns=['x1', 'x2', 'x3', 'x4', 'x5'])
                           

df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [5]:
# apply function is the most useful function with lambda function to filter out the data and get the output for each element of the column. 
df.x1.apply(lambda x :  'smallnum'  if x < 50  else x) # this is how to filter a dataframe with a specific condition.

0          51
1    smallnum
2          87
3          52
4    smallnum
5          75
6          90
Name: x1, dtype: object

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Basic Aggregation Methods</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

One of the most basic analysis functions is grouping and aggregating data. In some cases, this level of analysis may be sufficient to answer real-world/business questions. In other instances, this activity might be the first step in a more complex data science analysis. In pandas, the groupby function can be combined with one or more aggregation functions to quickly and easily summarize data. This concept is deceptively simple and most new pandas users will understand this concept. However, they might be surprised at how useful complex aggregation functions can be for supporting sophisticated analysis [Source](https://pbpython.com/groupby-agg.html).

An essential piece of analysis of large data is efficient summarization: computing aggregations, such as ``sum()``, ``mean()``, ``median()``, ``min()``, and ``max()``, in which a single number gives insight into the nature of a potentially large dataset. The aggregate() method allows you to apply a function or a list of function names to be executed along one of the axis of the DataFrame, default 0, which is the index (row) axis [Source](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html).

Often when faced with a large amount of data, a first step is to compute summary statistics for the data in question. Perhaps the most common summary statistics are the mean and standard deviation, which allow you to summarize the "typical" values in a dataset, but other aggregates are useful as well (the sum, product, median, minimum and maximum, quantiles, etc.).

NumPy has fast built-in aggregation functions for working on arrays which are also used for Pandas Dataframes [Pandas Official Documentation](https://pandas.pydata.org/docs/reference/frame.html); we'll discuss and demonstrate some of them here:

* ``count()`` ==> Counts non-NA cells for each column or row.
* ``mean()`` ==> Returns the mean of the values over the requested axis.
* ``median()`` ==> Returns the median of the values over the requested axis.
* ``min()`` ==> Returns the minimum of the values over the requested axis.
* ``max()`` ==> Returns the maximum of the values over the requested axis.
* ``std()`` ==> Returns sample standard deviation over requested axis.
* ``var()`` ==> Returns unbiased variance over requested axis.
* ``sum()`` ==> Returns the sum of the values over the requested axis.
* ``idxmin()`` ==> Returns index of first occurrence of minimum over requested axis.
* ``idxmax()`` ==> Returns index of first occurrence of maximum over requested axis.
* ``corr()`` ==> Computes pairwise correlation of columns, excluding NA/null values.

To sum up, in this session, we'll explore aggregations in Pandas, from simple operations akin to what we've seen on NumPy arrays, to more sophisticated operations based on the concept of a groupby.

In [6]:
df = pd.DataFrame(np.random.randint(0, 100, size=(7, 5)), # since this is a .randit operation it will give different set of numbers everytime, 
                  columns=["x1", "x2", "x3", "x4", "x5"])
df

   x1  x2  x3  x4  x5
0  79  14  61  61  46
1  61  50  54  63   2
2  50   6  20  72  38
3  17   3  88  59  13
4   8  89  52   1  83
5  91  59  70  43   7
6  46  34  77  80  35

In [7]:
df.std() # gives the standard deviation of each columnn.

x1    30.307943
x2    31.648366
x3    21.883893
x4    26.092327
x5    28.071338
dtype: float64

In [8]:
df['x4'].count() # here we picked a column and asked for the count (means the lenght of the column)

7

In [9]:
df.mean()

x1    50.285714
x2    36.428571
x3    60.285714
x4    54.142857
x5    32.000000
dtype: float64

In [10]:
df.x2.mean()
#dataframe.columnname.mean() give the mean of a specific column.

36.42857142857143

In [11]:
df.median()

x1    50.0
x2    34.0
x3    61.0
x4    61.0
x5    35.0
dtype: float64

In [12]:
df.x3.median()

61.0

In [13]:
df

   x1  x2  x3  x4  x5
0  79  14  61  61  46
1  61  50  54  63   2
2  50   6  20  72  38
3  17   3  88  59  13
4   8  89  52   1  83
5  91  59  70  43   7
6  46  34  77  80  35

In [14]:
df.min(axis="index") # this will give the minumum data in each column.

x1     8
x2     3
x3    20
x4     1
x5     2
dtype: int32

In [15]:
df.loc[3:6,'x4'].min() # this will give the minimum number between spesific rows.
# dataframe.loc[start row index: stop row index, 'Column Name'].min() or .max() or .count() etc will work

1

In [16]:
df

   x1  x2  x3  x4  x5
0  79  14  61  61  46
1  61  50  54  63   2
2  50   6  20  72  38
3  17   3  88  59  13
4   8  89  52   1  83
5  91  59  70  43   7
6  46  34  77  80  35

In [17]:
df.idxmax()

# df.argmin()
# # Raises an error of "AttributeError: 'DataFrame' object has no attribute 'argmin'""

x1    5
x2    4
x3    3
x4    6
x5    4
dtype: int64

In [18]:
# df.x5.idxmin()

df.x5

0    46
1     2
2    38
3    13
4    83
5     7
6    35
Name: x5, dtype: int32

Pandas dataframe.idxmin() function returns index of first occurrence of minimum over requested axis. While finding the index of the minimum value across any index, all NA/null values are excluded.

In [19]:
df.std()

x1    30.307943
x2    31.648366
x3    21.883893
x4    26.092327
x5    28.071338
dtype: float64

In [20]:
(df[["x1", "x2"]].std()) # this is the standard deviation of two columns. This will bering a series.

x1    30.307943
x2    31.648366
dtype: float64

In [21]:
pd.DataFrame(df[["x1", "x2"]].std()) #here we pass the series into a data frame. it is a new data frame.

            0
x1  30.307943
x2  31.648366

In [22]:
df.var()

x1     918.571429
x2    1001.619048
x3     478.904762
x4     680.809524
x5     788.000000
dtype: float64

In [23]:
df[["x1", "x2"]].var()

x1     918.571429
x2    1001.619048
dtype: float64

In [24]:
pd.DataFrame(df.sum(axis="rows"))

      0
x1  352
x2  255
x3  422
x4  379
x5  224

In [25]:
df.sum(axis=1)

0    261
1    230
2    186
3    180
4    233
5    270
6    272
dtype: int64

In [26]:
df

   x1  x2  x3  x4  x5
0  79  14  61  61  46
1  61  50  54  63   2
2  50   6  20  72  38
3  17   3  88  59  13
4   8  89  52   1  83
5  91  59  70  43   7
6  46  34  77  80  35

In [27]:
df.x1.sum()

352

In [28]:
df.describe()

              x1         x2         x3         x4         x5
count   7.000000   7.000000   7.000000   7.000000   7.000000
mean   50.285714  36.428571  60.285714  54.142857  32.000000
std    30.307943  31.648366  21.883893  26.092327  28.071338
min     8.000000   3.000000  20.000000   1.000000   2.000000
25%    31.500000  10.000000  53.000000  51.000000  10.000000
50%    50.000000  34.000000  61.000000  61.000000  35.000000
75%    70.000000  54.500000  73.500000  67.500000  42.000000
max    91.000000  89.000000  88.000000  80.000000  83.000000

In [29]:
# df.describe().transpose()

df.describe().T

    count       mean        std   min   25%   50%   75%   max
x1    7.0  50.285714  30.307943   8.0  31.5  50.0  70.0  91.0
x2    7.0  36.428571  31.648366   3.0  10.0  34.0  54.5  89.0
x3    7.0  60.285714  21.883893  20.0  53.0  61.0  73.5  88.0
x4    7.0  54.142857  26.092327   1.0  51.0  61.0  67.5  80.0
x5    7.0  32.000000  28.071338   2.0  10.0  35.0  42.0  83.0

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Groupby & Aggregation</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In Exploratory Data Analysis (EDA), we often would like to analyze data by some categories. In SQL, the GROUP BY statement groups row that has the same category values into summary rows. In Pandas, SQL's GROUP BY operation is performed using the similarly named **``groupby()``** method. Pandas' groupby() allows us to split data into separate groups to perform computations for better analysis [Source](https://towardsdatascience.com/all-pandas-groupby-you-should-know-for-grouping-data-and-performing-operations-2a8ec1327b5).

In this part of the session, you'll learn the "group by" process (split-apply-combine) and how to use Pandas's groupby() function to group data and perform operations.

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">DataFrame.groupby()</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**``groupby()``** method groups DataFrame using a mapper or by a Series of columns. A groupby operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups [Official Pandas Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html).

In other words, the **``groupby()``** method allows you to group rows of data together and call aggregate functions.

**``DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=NoDefault.no_default, observed=False, dropna=True)``**

In [30]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [31]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [32]:
titanic.groupby("alive")['age'].describe()

       count       mean        std   min   25%   50%   75%   max
alive
no     424.0  30.626179  14.172110  1.00  21.0  28.0  39.0  74.0
yes    290.0  28.343690  14.950952  0.42  19.0  28.0  36.0  80.0

In [33]:
titanic.age.mode()

0    24.0
Name: age, dtype: float64

In [34]:
df.head(30)

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [36]:
df.groupby('species')

In [37]:
df.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [38]:
df.groupby("species").mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [39]:
df.groupby("species").describe() # this will give us a summary of the dataset grouped by the species column.

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [40]:
df.groupby("species").describe().T # here we see each column shonw in details with transpose operator.

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [41]:
df.groupby('species')['sepal_length'].mean() # here we ask the mean of one single column.

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [42]:
df.groupby('species').sum().sepal_width # here we use the sum with .columnname method to specify which row we want to group by.

species
setosa        171.4
versicolor    138.5
virginica     148.7
Name: sepal_width, dtype: float64

In [43]:
df.groupby('species').sepal_length.sum()

species
setosa        250.3
versicolor    296.8
virginica     329.4
Name: sepal_length, dtype: float64

In [44]:
df.groupby('species')[['sepal_length', "sepal_width"]].sum() # here we select only two columns to sum and see them side by side.

            sepal_length  sepal_width
species
setosa             250.3        171.4
versicolor         296.8        138.5
virginica          329.4        148.7

In [45]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'GOOG', 'MSFT', 'GOOG', 'MSFT'],
        'Department':['HR', 'IT', 'IT', 'HR', 'HR', 'IT', 'IT', 'HR'],
        'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah', 'Tom', 'Terry'],
        'Age':[30, 28, 35, 40, 42, 25, 32, 48],
        'Sales':[200, 120, 340, 124, 243, 350, 180, 220]}

In [46]:
df1 = pd.DataFrame(data)
df1

  Company Department   Person  Age  Sales
0    GOOG         HR      Sam   30    200
1    GOOG         IT  Charlie   28    120
2    MSFT         IT      Amy   35    340
3    MSFT         HR  Vanessa   40    124
4    GOOG         HR     Carl   42    243
5    MSFT         IT    Sarah   25    350
6    GOOG         IT      Tom   32    180
7    MSFT         HR    Terry   48    220

In [47]:
df1.groupby('Company').mean() # this will only bring the numeric columnn.

C:\Users\ahmet\AppData\Local\Temp\ipykernel_5872\4109683825.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df1.groupby('Company').mean() # this will only bring the numeric columnn.

          Age   Sales
Company
GOOG     33.0  185.75
MSFT     37.0  258.50

In [48]:
df1.groupby('Company')["Sales", "Age"].mean() # when we want to have multiple columns, we use square brackets after the groupby.

C:\Users\ahmet\AppData\Local\Temp\ipykernel_5872\2059171283.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df1.groupby('Company')["Sales", "Age"].mean() # when we want to have multiple columns, we use square brackets after the groupby.

          Sales   Age
Company
GOOG     185.75  33.0
MSFT     258.50  37.0

In [49]:
df1.groupby('Company')[["Sales"]].mean() # this will bring the data frame version of only sales.

          Sales
Company
GOOG     185.75
MSFT     258.50

In [50]:
df1.groupby(['Company', "Department"]).mean() # this will first group by the company then by the department names.

C:\Users\ahmet\AppData\Local\Temp\ipykernel_5872\1061010610.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df1.groupby(['Company', "Department"]).mean() # this will first group by the company then by the department names.

                     Age  Sales
Company Department
GOOG    HR          36.0  221.5
        IT          30.0  150.0
MSFT    HR          44.0  172.0
        IT          30.0  345.0

In [51]:
df1.groupby(['Company', "Department"])[["Sales"]].mean() # we picked the company and department rows and grouped by them. 
# we selected only the sales column.

                    Sales
Company Department
GOOG    HR          221.5
        IT          150.0
MSFT    HR          172.0
        IT          345.0

In [52]:
df1.groupby(['Company', "Department"])[["Sales"]].describe()

                   Sales                                                  \
                   count   mean        std    min     25%    50%     75%
Company Department
GOOG    HR           2.0  221.5  30.405592  200.0  210.75  221.5  232.25
        IT           2.0  150.0  42.426407  120.0  135.00  150.0  165.00
MSFT    HR           2.0  172.0  67.882251  124.0  148.00  172.0  196.00
        IT           2.0  345.0   7.071068  340.0  342.50  345.0  347.50


                      max
Company Department
GOOG    HR          243.0
        IT          180.0
MSFT    HR          220.0
        IT          350.0

**Now you can use the ``.groupby()`` method to group rows together based on a column name. For instance, let's group based on Company. This will create a DataFrameGroupBy object:**

You can save this object as a new variable:

In [53]:
df1.groupby('Company') # groupby brings only an address for the data that is ready to be extracted.

In [54]:
by_comp = df1.groupby('Company')

And then call aggregate methods off the object:

In [55]:
by_comp.mean()

C:\Users\ahmet\AppData\Local\Temp\ipykernel_5872\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

          Age   Sales
Company
GOOG     33.0  185.75
MSFT     37.0  258.50

In [56]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">DataFrame/Series Operations</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- ### `.aggregate()`
- ### `.filter()`
- ### `.transform()`
- ### `.apply()`
- ### `.applymap()`
- ### `.map()`
- ### `.pivot() & .pivot_table()`
- ### `.stack() & .unstack()`

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:center; border-radius:10px 10px;">.aggregate() / agg()</p>

<a id="3.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`DataFrame.aggregate(func=None, axis=0, *args, **kwargs)`**

Returns: scalar, Series or DataFrame

The return can be:
- scalar : when Series.agg is called with single function
- Series : when DataFrame.agg is called with a single function
- DataFrame : when DataFrame.agg is called with several functions (Returns scalar, Series or DataFrame).

The aggregation operations are always performed over an axis, either the index (default) or the column axis. This behavior is different from numpy aggregation functions (mean, median, prod, sum, std, var), where the default is to compute the aggregation of the flattened array, e.g., numpy.mean(arr_2d) as opposed to numpy.mean(arr_2d, axis=0).

**agg()** is an **alias for aggregate()**. Use the alias [Official Pandas Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html).

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">DataFrame.agg()</p>

<a id="3.1.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [57]:
df2 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10, 23, 33, 22, 11, 99, 76, 84, 45],
                   'var2': [100, 253, 333, 262, 111, 969, 405, 578, 760]},
                   index=list("ABCDEFGHI"))
backup_df2 = df2.copy()

df2

  groups  var1  var2
A      A    10   100
B      B    23   253
C      C    33   333
D      A    22   262
E      B    11   111
F      C    99   969
G      A    76   405
H      B    84   578
I      C    45   760

In [58]:
df2.loc['A':'D', 'groups']

A    A
B    B
C    C
D    A
Name: groups, dtype: object

In [59]:
df2.agg([sum, min])

        groups  var1  var2
sum  ABCABCABC   403  3771
min          A    10   100

In [60]:
# dir(__builtins__)

In [61]:
vars_of_interest = ["var1", "var2"]  # created by ...
df2[vars_of_interest].agg([sum, min])

     var1  var2
sum   403  3771
min    10   100

In [62]:
df2.agg({"var1":sum, "var2":min})

var1    403
var2    100
dtype: int64

In [63]:
df2.agg({"var1":[sum], "var2":[min]})

      var1   var2
sum  403.0    NaN
min    NaN  100.0

In [64]:
df2.agg({"var1":[sum,  np.mean], "var2":[min, max]})

            var1   var2
sum   403.000000    NaN
mean   44.777778    NaN
min          NaN  100.0
max          NaN  969.0

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">DataFrame.groupby().agg()</p>

<a id="3.1.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**``DataFrameGroupBy.agg(arg, *args, **kwargs)``**

Aggregates using one or more operations over the specified axis [Pandas Official Documentation](https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.core.groupby.DataFrameGroupBy.agg.html).

[SOUREC01](https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/) & [SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/groupby-pandas-aggregating-data-python/)

In [65]:
df2

  groups  var1  var2
A      A    10   100
B      B    23   253
C      C    33   333
D      A    22   262
E      B    11   111
F      C    99   969
G      A    76   405
H      B    84   578
I      C    45   760

In [66]:
df2.groupby('groups').aggregate([np.min, np.median, np.max])

       var1             var2
       amin median amax amin median amax
groups
A        10   22.0   76  100  262.0  405
B        11   23.0   84  111  253.0  578
C        33   45.0   99  333  760.0  969

In [67]:
df2.groupby('groups').agg([np.min, np.median, max])

       var1            var2
       amin median max amin median  max
groups
A        10   22.0  76  100  262.0  405
B        11   23.0  84  111  253.0  578
C        33   45.0  99  333  760.0  969

In [68]:
df2.groupby('groups').agg({'var1':(min, 'max'), 'var2':'median'}) # here we pass first the group by for groups and get the aggreagate. 
# then for var1 columns we bring min, max, and var2 the median.

       var1       var2
        min max median
groups
A        10  76  262.0
B        11  84  253.0
C        33  99  760.0

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">.filter()</p>

<a id="3.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Pandas **``Dataframe.filter()``** is an inbuilt function that is used to subset columns or rows of DataFrame according to labels in the particular index. The DataFrame **``filter()``** returns subset the DataFrame rows or columns according to the detailed index labels. **One thing to note that** this routine does **NOT** filter a DataFrame on its contents. The filter() function is applied to the labels of the index[Pandas Official Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.filter.html)

[SOUREC01](https://www.sharpsightlabs.com/blog/pandas-filter/) & [SOURCE02](https://appdividend.com/2020/03/19/pandas-filter-pandas-dataframe-filter-in-python-example/)

In [69]:
df2

  groups  var1  var2
A      A    10   100
B      B    23   253
C      C    33   333
D      A    22   262
E      B    11   111
F      C    99   969
G      A    76   405
H      B    84   578
I      C    45   760

In [70]:
df2.filter(["groups", "var1"])

#df2[["groups", "var1"]]

  groups  var1
A      A    10
B      B    23
C      C    33
D      A    22
E      B    11
F      C    99
G      A    76
H      B    84
I      C    45

In [71]:
df2.filter(regex="^var", axis=1)

   var1  var2
A    10   100
B    23   253
C    33   333
D    22   262
E    11   111
F    99   969
G    76   405
H    84   578
I    45   760

In [72]:
# The "like" parameter enables you to identify items that contain a certain string.

df2.filter(like="var", axis=1)

   var1  var2
A    10   100
B    23   253
C    33   333
D    22   262
E    11   111
F    99   969
G    76   405
H    84   578
I    45   760

In [73]:
df2.filter(like="I", axis=0)

  groups  var1  var2
I      C    45   760

In [74]:
from collections import Counter

In [75]:
def most_frequent(x):
    freq = Counter(x)
    rev_freq = dict(zip(freq.values(), freq.keys()))
    return rev_freq[max(freq.values())]

In [76]:
Counter([1, 5, 3, 1, 1, 4, 8, 9, 6, 7, 1, 4, 4, 1])

Counter({1: 5, 5: 1, 3: 1, 4: 3, 8: 1, 9: 1, 6: 1, 7: 1})

In [77]:
data1 = [1, 5, 3, 1, 1, 4, 8, 9, 6, 7, 1, 4, 4, 1]
most_frequent(data1)

1

In [78]:
data2 = [5, 7, 7, 7, 7, 2, 3, 1, 1, 1, 1, 2, 9, 0]

In [79]:
test_df = pd.DataFrame({"Column1": data1,
                        "Column2": data2})
test_df

    Column1  Column2
0         1        5
1         5        7
2         3        7
3         1        7
4         1        7
5         4        2
6         8        3
7         9        1
8         6        1
9         7        1
10        1        1
11        4        2
12        4        9
13        1        0

In [80]:
test_df.agg(most_frequent)

Column1    1
Column2    1
dtype: int64

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">DataFrame.groupby().filter()</p>

<a id="3.2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`DataFrameGroupBy.filter(func, dropna=True, *args, **kwargs)`**
- Returns a copy of a DataFrame excluding filtered elements.
- Elements from groups are filtered if they do not satisfy the boolean criterion specified by func [Official Pandas Document](https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.filter.html).

In [81]:
df2

  groups  var1  var2
A      A    10   100
B      B    23   253
C      C    33   333
D      A    22   262
E      B    11   111
F      C    99   969
G      A    76   405
H      B    84   578
I      C    45   760

In [82]:
df2.reset_index(inplace=True)

In [83]:
df2

  index groups  var1  var2
0     A      A    10   100
1     B      B    23   253
2     C      C    33   333
3     D      A    22   262
4     E      B    11   111
5     F      C    99   969
6     G      A    76   405
7     H      B    84   578
8     I      C    45   760

In [84]:
df2["groups"].unique()

array(['A', 'B', 'C'], dtype=object)

In [85]:
df2.groupby("groups").mean()

C:\Users\ahmet\AppData\Local\Temp\ipykernel_5872\3055505053.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby("groups").mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [86]:
def filter_func(x):
    return x["var1"].mean() > 39

In [87]:
# returns the rows that meet the condition, as a DataFrame

df2.groupby('groups').filter(filter_func)

  index groups  var1  var2
1     B      B    23   253
2     C      C    33   333
4     E      B    11   111
5     F      C    99   969
7     H      B    84   578
8     I      C    45   760

In [88]:
df2.groupby("groups").sum()

C:\Users\ahmet\AppData\Local\Temp\ipykernel_5872\258568076.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby("groups").sum()

        var1  var2
groups
A        108   767
B        118   942
C        177  2062

In [89]:
df2.groupby('groups').filter(lambda x : x['var2'].sum() < 800)

  index groups  var1  var2
0     A      A    10   100
3     D      A    22   262
6     G      A    76   405

In [90]:
df2.groupby('groups')[["var2"]].filter(lambda x : x.sum() < 800)

   var2
0   100
3   262
6   405

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">.transform()</p>

<a id="3.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`DataFrame.transform(func, axis=0, *args, **kwargs)`**

- Returns DataFrame
- Call func on self producing a DataFrame that must have the same length as self.

Python’s Transform function returns a self-produced dataframe with transformed values after applying the function specified in its parameter. This dataframe has the same length as the passed dataframe. **``transform()``** is an operation mostly used in conjunction with groupby (which is one of the most useful operations in pandas). It is a powerful function that you can lean on for **feature engineering** in Python. As the name (feature engineering) suggests, it enables us to extract new features from existing ones. Let’s understand the importance of the transform function with the help of an example. 

[SOUREC01](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.transform.html) & [SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/understanding-transform-function-python/)

In [91]:
df2

  index groups  var1  var2
0     A      A    10   100
1     B      B    23   253
2     C      C    33   333
3     D      A    22   262
4     E      B    11   111
5     F      C    99   969
6     G      A    76   405
7     H      B    84   578
8     I      C    45   760

In [92]:
df2 = backup_df2 
df_num = df2.iloc[:, 1:3]
df_num

   var1  var2
A    10   100
B    23   253
C    33   333
D    22   262
E    11   111
F    99   969
G    76   405
H    84   578
I    45   760

In [93]:
df_num.transform(lambda x : x+10)

#df_num+10

   var1  var2
A    20   110
B    33   263
C    43   343
D    32   272
E    21   121
F   109   979
G    86   415
H    94   588
I    55   770

In [94]:
# returns A DataFrame that must have the same length as self. Standardization(mean 0 std 1) Normalization (0-1)
# z-score is is z = (x-μ)/σ, where x is the raw score, μ is the population mean, and σ is the population standard deviation.

df_num.transform(lambda x : (x-x.mean()) / x.std())

#(df_num-df_num.mean())/df_num.std()

# This is the dataframe we get after applying Transform function:

       var1      var2
A -1.040605 -1.078044
B -0.651625 -0.560989
C -0.352409 -0.290633
D -0.681547 -0.530573
E -1.010684 -1.040870
F  1.622413  1.858697
G  0.934218 -0.047312
H  1.173590  0.537332
I  0.006649  1.152392

In [95]:
df_num["var1"].transform(lambda x : (x-x.mean())/x.std())

A   -1.040605
B   -0.651625
C   -0.352409
D   -0.681547
E   -1.010684
F    1.622413
G    0.934218
H    1.173590
I    0.006649
Name: var1, dtype: float64

In [96]:
df_num.var1.transform(np.sqrt)

A    3.162278
B    4.795832
C    5.744563
D    4.690416
E    3.316625
F    9.949874
G    8.717798
H    9.165151
I    6.708204
Name: var1, dtype: float64

I did this based on Memo 220 of Jan 5.

In [97]:
table = df_num.transform([np.sqrt, np.exp])
table

       var1                     var2
       sqrt           exp       sqrt            exp
A  3.162278  2.202647e+04  10.000000   2.688117e+43
B  4.795832  9.744803e+09  15.905974  7.524955e+109
C  5.744563  2.146436e+14  18.248288  4.169294e+144
D  4.690416  3.584913e+09  16.186414  6.097534e+113
E  3.316625  5.987414e+04  10.535654   1.609487e+48
F  9.949874  9.889030e+42  31.128765            inf
G  8.717798  1.014800e+33  20.124612  7.749348e+175
H  9.165151  3.025077e+36  24.041631  1.052472e+251
I  6.708204  3.493427e+19  27.568098            inf

As seen above, transform comes in handy during feature extraction. As the name suggests, it enables us to extract new features from existing ones.

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">DataFrame.groupby().transform()</p>

<a id="3.3.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`DataFrameGroupBy.transform(func, *args, engine=None, engine_kwargs=None, **kwargs)`**
- Call function producing a like-indexed DataFrame on each group and return a DataFrame having the same indexes as the original object filled with the transformed values. [Official Pandas Document](https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.transform.html).

In [98]:
df2.groupby("groups")["var1"].mean()

groups
A    36.000000
B    39.333333
C    59.000000
Name: var1, dtype: float64

In [99]:
df2

  groups  var1  var2
A      A    10   100
B      B    23   253
C      C    33   333
D      A    22   262
E      B    11   111
F      C    99   969
G      A    76   405
H      B    84   578
I      C    45   760

In [100]:
df2.groupby("groups")["var1"].transform("mean")

A    36.000000
B    39.333333
C    59.000000
D    36.000000
E    39.333333
F    59.000000
G    36.000000
H    39.333333
I    59.000000
Name: var1, dtype: float64

In [101]:
df2["var1_mean_transform"] = df2.groupby("groups")["var1"].transform("mean")
df2

  groups  var1  var2  var1_mean_transform
A      A    10   100            36.000000
B      B    23   253            39.333333
C      C    33   333            59.000000
D      A    22   262            36.000000
E      B    11   111            39.333333
F      C    99   969            59.000000
G      A    76   405            36.000000
H      B    84   578            39.333333
I      C    45   760            59.000000

In [102]:
df2["var2_median_transform"] = df2.groupby("groups")["var2"].transform("median")
df2

  groups  var1  var2  var1_mean_transform  var2_median_transform
A      A    10   100            36.000000                  262.0
B      B    23   253            39.333333                  253.0
C      C    33   333            59.000000                  760.0
D      A    22   262            36.000000                  262.0
E      B    11   111            39.333333                  253.0
F      C    99   969            59.000000                  760.0
G      A    76   405            36.000000                  262.0
H      B    84   578            39.333333                  253.0
I      C    45   760            59.000000                  760.0

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">.apply()</p>

<a id="3.4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)`**

- Returns Series or DataFrame
- Result of applying func along the given axis of the DataFrame [Official Pandas Document](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html).

One alternative to using a loop to iterate over a DataFrame is to use the **pandas.apply()** method. This function acts as a **`map()`** function in Python. It takes a function as an input and applies this function to an entire DataFrame. **apply()** is used to apply a function along an axis of the DataFrame or on values of Series. In other words, **`pandas.apply()`** allows users to pass a function and apply it to *every single value* of the Pandas series. This function does *NOT* make changes to the original DataFrame object.

[SOUREC01](https://www.geeksforgeeks.org/python-pandas-apply/), [SOURCE02](https://www.datacamp.com/community/tutorials/pandas-apply) & [SOURCE03](https://sparkbyexamples.com/pandas/pandas-apply-function-usage-examples/)

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Series.apply() - df["col"].apply()</p>

<a id="3.4.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`Series.apply(func, convert_dtype=True, args=(), **kwargs)`**
- Invoke function on values of Series.
- Can be ufunc (a NumPy function that applies to the entire Series) or a Python function that only works on single values.. [Official Pandas Document](https://pandas.pydata.org/pandas-docs/version/0.25.0/reference/api/pandas.Series.apply.html).

In [103]:
df3 = pd.DataFrame({'col1':[1, 2, 3, 4],
                    'col2':[444, 555, 666, 444],
                    'col3':['abc', 'def', 'ghi', 'xyz']})
df3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [104]:
def squared(x):
    return x**2

In [105]:
df3['col1'].apply(squared)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [106]:
df3.col1.transform(squared)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [107]:
df3['col2'].apply(np.log)

0    6.095825
1    6.318968
2    6.501290
3    6.095825
Name: col2, dtype: float64

In [108]:
df3['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [109]:
df3['col3'].apply(lambda x: x[0] * 3)

0    aaa
1    ddd
2    ggg
3    xxx
Name: col3, dtype: object

In [110]:
df3['col3'].transform(lambda x: x[0] * 3)

0    aaa
1    ddd
2    ggg
3    xxx
Name: col3, dtype: object

In [111]:
df3['col2'].apply(lambda x: "low" if x > 500 else "high")

0    high
1     low
2     low
3    high
Name: col2, dtype: object

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">DataFrame.apply()</p>

<a id="3.4.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)`**
- Returns Series or DataFrame
- Result of applying function along the given axis of the DataFrame. [Official Pandas Document](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html).

In [112]:
df2

  groups  var1  var2  var1_mean_transform  var2_median_transform
A      A    10   100            36.000000                  262.0
B      B    23   253            39.333333                  253.0
C      C    33   333            59.000000                  760.0
D      A    22   262            36.000000                  262.0
E      B    11   111            39.333333                  253.0
F      C    99   969            59.000000                  760.0
G      A    76   405            36.000000                  262.0
H      B    84   578            39.333333                  253.0
I      C    45   760            59.000000                  760.0

In [ ]:
df2.drop(["var1_mean_transform", "var2_median_transform"], axis=1, inplace=True)
df2

In [ ]:
# sum() functions works with putting + sign between each element of an iterable object

df2.apply(np.sum)

In [ ]:
# It gives an error due to the non-numeric column : "groups"

# df2.apply(np.sum, axis=1)

In [ ]:
df_num

In [ ]:
df_num.apply(np.sum)

#df_num.sum()

In [ ]:
df_num[['var1', 'var2']].agg(np.sum)

In [ ]:
df_num.apply(np.sum, axis=1)

#df_num.sum(axis=1)

In [ ]:
df_num.apply(lambda x : x + 10)

In [ ]:
df_num.transform(lambda x : x + 10)

In [ ]:
df2.groupby('groups')[['var1','var2']].apply(np.mean, axis=0)

In [ ]:
df2.groupby("groups").mean()

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">DataFrame.applymap()</p>

<a id="3.5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**`DataFrame.applymap(func, na_action=None, **kwargs)`**
- Apply a function to a Dataframe elementwise.
- This method applies a function that accepts and returns a scalar to every element of a DataFrame. [Official Pandas Document](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html).

In [ ]:
df_num

In [ ]:
df_num.applymap(lambda x: x*5)

#df_num.apply(lambda x: x*5)
#df_num*5

In [ ]:
df_num.applymap(lambda x: len(str(x*5)))

In [ ]:
df_num.apply(lambda x: len(str(x*5)))

## Then what is the difference between applymap() & apply() ?

- **applymap()** is only available in DataFrame and used for element-wise operation across the whole DataFrame. It has been optimized and in some cases works **much faster than apply()**

- **applymap()** method only works on a pandas DataFrame where function is applied on every element individually. 

- **apply()** method can apply a provided function both to Series and DataFrames.

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">.map()</p>

<a id="3.6"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**``Series.map(arg, na_action=None)``**
- Map values of Series according to an input mapping or function.
- Used for substituting each value in a Series with another value, that may be derived from a function, a dict or a Series. [Official Pandas Document](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html).

***************************************************************************************************************************

- Python's **map()** is a built-in function that allows you to process and transform all the items in an iterable without using an explicit for loop, a technique commonly known as mapping.
- **map()** is useful when you need to apply a transformation function to each item in an iterable and transform them into a new iterable [Source](https://realpython.com/python-map-function/#:~:text=Python's%20map()%20is%20a,them%20into%20a%20new%20iterable.).

- The **map()** function is used to map values of Series according to input correspondence. Used for substituting each value in a Series with another value, that may be derived from a function, a dict or a Series.
- **map()** accepts a dict or a Series. Values that are not found in the dict are converted to NaN, unless the dict has a default value [Source](https://www.w3resource.com/pandas/series/series-map.php).

In [ ]:
df3

In [ ]:
df3.col1.map({1:"A", 2:"B"})

In [ ]:
s = pd.Series(['fox', 'cow', np.nan, 'dog'])
s

In [ ]:
str(np.nan)

In [ ]:
s.map('I am a {}'.format)

In [ ]:
s.map('I am a {}'.format, na_action='ignore')

**apply()** is used to apply a function along an axis of the DataFrame or on values of Series.<br> 
**applymap()** is used to apply a function to a DataFrame elementwise.<br> 
**map()** is used to substitute each value in a Series with another value.

[SOURCE01](https://towardsdatascience.com/introduction-to-pandas-apply-applymap-and-map-5d3e044e93ff#:~:text=apply()%20is%20used%20to,a%20Series%20with%20another%20value.), [SOURCE](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas)

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">df.transform() vs df.apply()</p>

<a id="3.7"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

### Similarties
- Both apply() and transform() can be used to manipulate the entire DataFrame.
- Both apply() and transform() support lambda expression.
- Both apply() and transform() can be used for manipulating a single column.

In [ ]:
df5 = pd.DataFrame({'A': [1,2,3], 'B': [10,20,30] })
df5

In [ ]:
df5.apply(lambda x: x+10)

In [ ]:
df5.transform(lambda x: x+10)

In [ ]:
df5['B_ap'] = df5['B'].apply(lambda x: x+10)
df5['B_tr'] = df5['B'].transform(lambda x: x+10)
df5

### Differences between .apply() and .transform() when manupulating data
- **transform()** works with function, a string function, a list of functions, and a dict. However, **apply()** is only allowed with function.
- **transform()** cannot produce aggregated results.
- **apply()** works with multiple Series (columns) at a time. But, **transform()** is only allowed to work with a single Series (column) at a time.

In [ ]:
df5 = df5[["A","B"]]
df5

In [ ]:
# (1) transform() works with function, a string function, a list of functions, and a dict. 
# However, apply() is only allowed with function.

df5.transform('sqrt')

# df5.apply('sqrt') # Error

In [ ]:
df5.transform(np.sqrt)

#df5.apply(np.sqrt)

In [ ]:
# df5.transform([np.sqrt, np.exp])

df5.apply([np.sqrt, np.exp])

In [ ]:
df5.transform({'A': np.sqrt, 'B': np.exp})

#df5.apply({'A': np.sqrt, 'B': np.exp})

In [ ]:
# (2) transform() cannot produce aggregated results.

df5.apply(lambda x: x.sum())

# df5.transform(lambda x:x.sum()) # gives an error

In [ ]:
df5.apply(lambda x: x["B"]-x["A"], axis=1)  # multiple columns as input

# df5.transform(lambda x: x["B"]-x["A"], axis=1) # gives an error

### Differences Between .apply() and .transform() when using them in conjunction with groupby()
- **transform()** returns a DataFrame that has the same length as the input
- **apply()** works with multiple Series at a time. But, **transform()** is only allowed to work with a single Series at a time.

In [ ]:
df6 = pd.DataFrame({'key': ['a','b','c'] * 3,
                    'A': np.arange(9),
                    'B': [1,2,3] * 3})
df6

In [ ]:
df6.groupby('key')['A'].sum()

In [ ]:
df6.groupby('key')['A'].apply(lambda x: x.sum())

**transform** does not collapse (aggregate) along axes.  It works with however many rows or columns it is given.

In [ ]:
df6.groupby('key')[['key','A']].transform(lambda x: x.sum())

In [ ]:
df6

In [ ]:
# (3) apply() works with multiple Series at a time. But, transform() is only allowed to work with a single Series at a time.

df6.groupby('key').apply(lambda x: x["B"]-x["A"])

# df6.groupby('key').transform(lambda x: x["B"]-x["A"]) # gives an error

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">pivot() vs pivot_table()</p>

<a id="8"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**pivot_table()**
- pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True).
- Create a spreadsheet-style pivot table as a DataFrame.
- The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.

**pivot()**
- DataFrame.pivot(index=None, columns=None, values=None).
- Return reshaped DataFrame organized by given index / column values.
- Reshape data (produce a “pivot” table) based on column values. Uses unique values from specified index / columns to form axes of the resulting DataFrame.
- This function does not support data aggregation, multiple values will result in a MultiIndex in the columns.

**Differences**
- **Pivot_table** is a generalization of pivot that **CAN** handle **duplicate values** for one pivoted index/column pair. However, **pivot()** is used for pivoting without aggregation. Therefore, it **CANNOT** deal with duplicate values for one index/column pair.
- **Pivot_table** will only allow numeric types as "values=", whereas **pivot** will take string types as "values=".
- **Pivot_table** also supports using multiple columns for the index.<br> 
[SOURCE](https://www.quora.com/In-pandas-whats-the-difference-between-dataframe-pivot-and-dataframe-pivot_table)

In [113]:
data = {'gender':['male', 'female', 'female', 'male', 'female', 'male'],
        'sport':['tennis', 'tennis', 'basketball', 'football', 'volleyball', 'basketball'],
        'status':["professional","professional","professional","amateur","amateur","amateur"],
        'age':[20, 24, 26, 23, 22, 21],
        'height':[185, 172, 175, 178, 182, 196],
        'weight':[83, 58, 62, 80, 65, 90]}

df7 = pd.DataFrame(data)

df7

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female  volleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [114]:
df7.pivot_table(index='gender',
                columns='sport',
                values=['age'],
                aggfunc='mean')

              age
sport  basketball football tennis volleyball
gender
female       26.0      NaN   24.0       22.0
male         21.0     23.0   20.0        NaN

In [115]:
df7.pivot_table(index='gender',
                columns='sport',
                values=['age','height','weight'],
                aggfunc='mean')

              age                                height                  \
sport  basketball football tennis volleyball basketball football tennis
gender
female       26.0      NaN   24.0       22.0      175.0      NaN  172.0
male         21.0     23.0   20.0        NaN      196.0    178.0  185.0

                      weight
sport  volleyball basketball football tennis volleyball
gender
female      182.0       62.0      NaN   58.0       65.0
male          NaN       90.0     80.0   83.0        NaN

In [116]:
df7.pivot(index='gender',
          columns='sport',
          values=['age','height','weight']).T

gender             female   male
       sport
age    basketball    26.0   21.0
       football       NaN   23.0
       tennis        24.0   20.0
       volleyball    22.0    NaN
height basketball   175.0  196.0
       football       NaN  178.0
       tennis       172.0  185.0
       volleyball   182.0    NaN
weight basketball    62.0   90.0
       football       NaN   80.0
       tennis        58.0   83.0
       volleyball    65.0    NaN

In [117]:
df7.pivot(index='gender',
          columns='sport',
          values='status')

sport     basketball football        tennis volleyball
gender
female  professional      NaN  professional    amateur
male         amateur  amateur  professional        NaN

In [ ]:
#gives an error because no numeric types to aggregate
#df7.pivot_table(index='gender',
#                columns='sport',
#                values='status')

In [ ]:
df7

In [ ]:
df7.loc[2,"sport"] = "tennis"
df7

In [ ]:
df7.pivot_table(index='gender',
                columns='sport',
                values=['age','height','weight'],
                aggfunc='mean')

In [ ]:
#gives an error because of the duplicate values
#df7.pivot(index='gender',
#          columns='sport',
#          values=['age','height','weight'])

In [ ]:
df7.pivot(columns='sport',
          values=['age','height','weight'])

In [ ]:
df7.pivot_table(index=['gender', 'sport'],
                values=['age','height','weight'],
                aggfunc='mean')

In [ ]:
#gives an error because of the lack of "columns" parameter
#df7.pivot(index=['gender', 'sport'],
#          values=['age','height','weight'])

In [118]:
df7.groupby(["gender","sport"]).mean()

C:\Users\ahmet\AppData\Local\Temp\ipykernel_5872\705751405.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df7.groupby(["gender","sport"]).mean()

                    age  height  weight
gender sport
female basketball  26.0   175.0    62.0
       tennis      24.0   172.0    58.0
       volleyball  22.0   182.0    65.0
male   basketball  21.0   196.0    90.0
       football    23.0   178.0    80.0
       tennis      20.0   185.0    83.0

In [119]:
df7.pivot_table(index=['gender', 'sport'],
                columns = "status",
                values=['age','height','weight'],
                aggfunc='mean')

                      age               height               weight  \
status            amateur professional amateur professional amateur
gender sport
female basketball     NaN         26.0     NaN        175.0     NaN
       tennis         NaN         24.0     NaN        172.0     NaN
       volleyball    22.0          NaN   182.0          NaN    65.0
male   basketball    21.0          NaN   196.0          NaN    90.0
       football      23.0          NaN   178.0          NaN    80.0
       tennis         NaN         20.0     NaN        185.0     NaN


status            professional
gender sport
female basketball         62.0
       tennis             58.0
       volleyball          NaN
male   basketball          NaN
       football            NaN
       tennis             83.0

In [ ]:
#gives an error because of the dublicate values
#df7.pivot(index=['gender', 'sport'],
#          columns = "status",
#          values=['age','height','weight'])

In [120]:
df7.pivot(columns = "status",
          values=['age','height','weight'])

           age               height               weight
status amateur professional amateur professional amateur professional
0          NaN         20.0     NaN        185.0     NaN         83.0
1          NaN         24.0     NaN        172.0     NaN         58.0
2          NaN         26.0     NaN        175.0     NaN         62.0
3         23.0          NaN   178.0          NaN    80.0          NaN
4         22.0          NaN   182.0          NaN    65.0          NaN
5         21.0          NaN   196.0          NaN    90.0          NaN

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">.stack() & .unstack()</p>

<a id="9"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Reshape using **``Stack()``** and **``unstack()``** function in Pandas python: Reshaping the data using **``stack()``** function in pandas converts the data into stacked format .i.e. the column is stacked row wise. When more than one column header is present we can stack the specific column header by specified the level. **``unstack()``** function in pandas converts the data into unstacked format [Source](https://www.datasciencemadesimple.com/reshape-using-stack-unstack-function-pandas-python/).

**Why and when should use a stack() and unstack() methods?**

[ANSWER](https://stackoverflow.com/questions/69139030/why-and-when-should-use-a-stack-and-unstack-methods)

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:left; border-radius:10px 10px;">.stack()</p>

<a id="9.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**``DataFrame.stack(level=- 1, dropna=True)``**
- Stack the prescribed level(s) from columns to index.
- Return a reshaped DataFrame or Series having a multi-level index with one or more new inner-most levels compared to the current DataFrame.
- The new inner-most levels are created by pivoting the columns of the current dataframe:
    - if the columns have a single level, the output is a Series;
    - if the columns have multiple levels, the new index level(s) is (are) taken from the prescribed level(s) and the output is a DataFrame.

In [121]:
df7

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female  volleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [122]:
df7["level"] = ["high", "high", "low", "high", "low", "low"]
df7

   gender       sport        status  age  height  weight level
0    male      tennis  professional   20     185      83  high
1  female      tennis  professional   24     172      58  high
2  female  basketball  professional   26     175      62   low
3    male    football       amateur   23     178      80  high
4  female  volleyball       amateur   22     182      65   low
5    male  basketball       amateur   21     196      90   low

In [123]:
df8 = df7.pivot_table(index=['gender','sport'],
                columns=["status","level"], 
                values=['age','height','weight'],
                aggfunc='mean')
df8

                      age                           height         \
status            amateur       professional       amateur
level                high   low         high   low    high    low
gender sport
female basketball     NaN   NaN          NaN  26.0     NaN    NaN
       tennis         NaN   NaN         24.0   NaN     NaN    NaN
       volleyball     NaN  22.0          NaN   NaN     NaN  182.0
male   basketball     NaN  21.0          NaN   NaN     NaN  196.0
       football      23.0   NaN          NaN   NaN   178.0    NaN
       tennis         NaN   NaN         20.0   NaN     NaN    NaN

                                       weight
status            professional        amateur       professional
level                     high    low    high   low         high   low
gender sport
female basketball          NaN  175.0     NaN   NaN          NaN  62.0
       tennis            172.0    NaN     NaN   NaN         58.0   NaN
       volleyball          NaN    NaN     NaN  65.0          NaN   NaN
male   basketball          NaN    NaN     NaN  90.0          NaN   NaN
       football            NaN    NaN    80.0   NaN          NaN   NaN
       tennis            185.0    NaN     NaN   NaN         83.0   NaN

In [ ]:
df8.stack()

In [ ]:
# try "-1, -2, 0, 1, 2" as level parameter

df8.stack(level=-2)

In [ ]:
df8.stack(level=-1, dropna=False)

In [ ]:
df8

In [ ]:
df8.stack().stack()

In [ ]:
df8.stack().stack().stack()

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:center; border-radius:10px 10px;">.unstack()</p>

<a id="9.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**``DataFrame.unstack(level=- 1, fill_value=None)``**
- Pivot a level of the (necessarily hierarchical) index labels.
- Returns a DataFrame having a new level of column labels whose inner-most level consists of the pivoted index labels.
- If the index is not a MultiIndex, the output will be a Series.

**``unstack()``** function pivots a level of the (necessarily hierarchical) index labels, returning a DataFrame having a new level of column labels whose inner-most level consists of the pivoted index labels [Source](https://www.w3resource.com/pandas/dataframe/dataframe-unstack.php).

In [ ]:
df8

In [ ]:
df8.unstack()

In [ ]:
df8.unstack().T

In [ ]:
df8

In [ ]:
# try "-1, 0, 1" as level parameter

df8.unstack(level=-1)

In [ ]:
df8.unstack(level=-1, fill_value=" ")

In [ ]:
df8.unstack().unstack()

In [ ]:
pd.DataFrame(df8.unstack().unstack())

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of The Session - 05 & 06</p>

<a id="10"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

________